# Основы синтаксиса python

На занятии мы успели рассмотреть:

1) Cтандартные **типы данных** :
- числа ([примеры](https://pythonworld.ru/tipy-dannyx-v-python/chisla-int-float-complex.html)):
  * целочисленные 
  * вещественные (с плавающей точкой)
  * комплексные
- строки ([примеры](https://pythonworld.ru/tipy-dannyx-v-python/stroki-funkcii-i-metody-strok.html))
- булевый (логический) тип 
- списки ([примеры] (https://pythonworld.ru/tipy-dannyx-v-python/spiski-list-funkcii-i-metody-spiskov.html), [про срезы](https://pythonworld.ru/osnovy/indeksy-i-srezy.html))
- кортежи ([примеры] (https://pythonworld.ru/tipy-dannyx-v-python/kortezhi-tuple.html))
- словари ([примеры](https://pythonworld.ru/tipy-dannyx-v-python/slovari-dict-funkcii-i-metody-slovarej.html))


2) **Условный оператор** ([примеры](https://pythonworld.ru/osnovy/instrukciya-if-elif-else-proverka-istinnosti-trexmestnoe-vyrazhenie-ifelse.html)).

3) **Циклы** ([примеры](https://pythonworld.ru/osnovy/cikly-for-i-while-operatory-break-i-continue-volshebnoe-slovo-else.html)).

Не успели рассмотреть **функции**, но многие при решение задачи их использовали или пытались использовать, поэтому все же [вот] (https://pythonworld.ru/tipy-dannyx-v-python/vse-o-funkciyax-i-ix-argumentax.html).

---

На занятии надо было написать программу, которая находит корни квадратного уравнения `ax^2 + bx + c = 0`, например так:

<details>
  <summary>Пример кода, который мог у вас получиться</summary>
  ```python
def find_roots(a, b, c):
	D =  b**2 - 4*a*c

	if D < 0:
		return "There are no real roots"
	x1 = (-b + D**(0.5)) / 2*a
	x2 = (-b - D**(0.5)) / 2*a

	return x1, x2

print("ax^2 + bx + c = 0")

a = int(input("Enter a: "))
b = int(input("Enter b: "))
c = int(input("Enter c: "))

print(find_roots(a, b, c))
```
</details>

Если у вас остались вопросы или недопонимание чего-то, то всегда можете задать вопросы личные сообщения или в [сообщения группы](https://vk.com/im?media=&sel=-129520208).

---
### Домашнее задание
[Подготовительные работы](l0.md)

Конечно, можно спрашивать и советоваться.
Для тех, кто сделает правильно задания до вечера воскресенья, будет какой-нибудь приятный бонус.

<details>
  <summary>1. Небольшое задание, чтобы попробовать возможности языка</summary>
В одной школе занятия начинаются в 8:00. Продолжительность урока — 45 минут, а после 1-го, 3-го, 5-го и т.д. уроков перемена 5 минут, зато после 2-го, 4-го, 6-го и т.д. — 15 минут.

#####Входные данные:
Дан номер урока (уроков может быть 10, ведь целых 2 смены). Определите, когда заканчивается указанный урок.

#####Выходные данные:
Выведите строку: время окончания урока в часах и минутах.

#### Пример
> Входные данные:
>   3
> 
> Выходные данные:
>   10:35

</details>

<details>
  <summary>2. Задача для тех, кому нравится придумывать алгоритмы</summary>
  Необходимо по заданному числу *n (1 < n < 10)* вывести на экран *n* птичек. Изображение одной птички имеет размер 5х9 символов. Между двумя птичками должен быть пустой столбец. Для упрощения, можно использовать пингвина. Но если вы придумаете свой вариант птички, то будет здорово!
```
   _~_    
  (o o)   
 /  V  \  
/(  _  )\ 
  ^^ ^^   
```
#### Пример
> Входные данные:
> 3
> 
> Выходные данные:
> ```
   _~_       _~_       _~_    
  (o o)     (o o)     (o o)   
 /  V  \   /  V  \   /  V  \  
/(  _  )\ /(  _  )\ /(  _  )\ 
  ^^ ^^     ^^ ^^     ^^ ^^   
```
</details>

<details>
  <summary>3. Задача из CTF</summary>
  Для этой задачи придется не только программировать, но и подумать, но в целом она несложная.
  Пробуйте, пишите где остановились, будем подсказывать.
  http://2016.hackerdom.ru/tasks/open/1/
</details>
