# Web-scraping

1) Рассмотрели **функции** в питоне:
<details> <summary>С обязательными аргументами </summary>

```python
# Функция, которая принмает 2 аргумента
def foo(name, age):
  print('Hi %s, I know you are %d years old %)' % (name, age))
  

user_name = input('Enter your name: ')
user_age = input('Enter your age: ')

# Именно 2 аргумента мы и должны передать, иначе будет ошибка
foo(user_name, user_age)
```

Функции без аргументов относятся к этому типу, просто обязательных аргументов у них 0.

```python
import random

def foo():
  a = random.random()
  b = 10
  
  if a > b:
    return a
  else:
    return b
  
print(foo())
```

</details>
<details> <summary>С аргументами - ключевыми словами</summary>
Функции с ключевыми словами позволяют при вызове функции передавать параметры в произвольном порядке.

```python
# Функция, которая принмает 2 аргумента, важно заметить что сначала мы передаем Имя, а потом Возраст
def foo(name, age):
  print('Hi %s, I know you are %d years old %)' % (name, age))
  

user_name = input('Enter your name: ')

# Пишем ключевое слово - имя параметра, которое мы объявили в функции, а затем через = передаем значение
foo(age=15, name=user_name)
```
</details>

<details><summary>С аргументами, которые могут быть заданы по умолчанию</summary>
Случаются ситуации, когда в большинстве случаев параметр принимает одно значение, и лишь в некоторых совсем другое.
В этом случае очень удобно использовать аргументы, которые инициализируются в функции, когда параметр не задан.

```python
# В функции два аргумента Имя и Возраст. Возраст инициализируем значением по умолчанию.
# Важно заметить, что если в объявлении функции вы хотите использовать аргументы, которые обязательно
# должны быть переданы, и аргументы, которые проинициализированны значением по умолчанию, то сначала
# указываются аргументы, которые обязательно должны быть переданы, а далее уже со значениями по умолчанию.
def foo(name, age=15):
  print('Hi %s, I know you are %d years old %)' % (name, age))
  

user_name = input('Enter your name: ')
# Так как параметр возраст уже задан в функции, то передав только один аргумент, это не вызовет ошибки
# и переменная возраст проинициализируется значением по умолчанию - 15
foo(user_name)

# Но если нам необходимо другое значение аргумента age в функции, то просто передаем новое значение.
age = imput('Enter your age: ')
foo(name, age)
# Или
foo(name, 145)
```
</details>
<details><summary>С аргументами произвольной длины</summary>
Также бывают ситуации, когда количество аргументов, которые необходимо передать в функцию неизвестно.
Тогда аргументы произвольной длины можно передать через переменную, перед которой ставится *:

```python
# На самом деле в функцию передается кортеж из элементов
def foo(*args):
  #По кортежу мы можем итерироваться, поэтому можно все элементы вывести каждый с новый строки.
  for my_argument in args:
    print(my_argument)


# Вызвать функцию очень просто - достаточно просто передать все параметры, которые вам нужны
foo(1, 3, 4, 'Hey', list('Hello world!'))
# А можно передать просто один
foo(1)
# Или не передавать ничего, но не забывать о таком случае в функции.
foo()
```
</details>

---

### Калькулятор
простой вариант:
 - приветствие пользователя с вариантами команд
 - сложение
 - вычитание
 - умножение
 - деление
 
 сложнее:
 - вычислить квадратные корни уравнения
 - синус
 - косинус
 - какую-нибудь производную
 - квадратный корень
 
 ---
 # Домашнее задание
 
 Написать программу - телефонная книга. 
 Постараться реализовать как можно больше функционала.
 
 1. Все данные при входе в программу считываются из json файла
 2. При выходе из программы, все записывается в json файл
 3. Должна быть функция с выводом меню для пользователя
 4. Данные, которые можно вносить: ФИО, телефон, имейл, комментарий
 
 В меню должна быть возможность:  
 
 5. Добавить новую запись: ФИО должно быть уникальным, телефонов и почт может быть несколько, комментарии все записываются как один текст. При записи, добавляется id записи по порядку  
 6. Удалить запись по id  
 7. Изменить любые данные в записи  
 8. Поиск по имени/части имени  
 9. Показать всех, кто начинается на %some_str%  
 10. Сохранять в файл  
 
 Дополнительно было бы круто реализовать:  
 11. Проверка, что введенный телефон является телефоном (возможно придумать свой строгий формат и просить вводить)  
 12. Проверка, что введенный имейл является имейлом.  
 13. В аргументы командной строки передавать имя файла откуда брать имена и куда записывать
 
 ```bash
 >>>
 ```
