# Ошибки и исключения

Рассмотрели какие ошибки могут появляться в программах.

Условно все ошибки можно разделить на **синтаксические ошибки** (`syntax errors`) и **исключения** (`exceptions`).

---

Как правило **синтаксические ошибки** являются наиболее распространенными и являются фатальными, т.е такими, когда парсер питона не может понять кусочек кода и соответственно совсем нет варианта исполнить этот код и программа завершается с ошибкой.

К синтаксическим ошибкам можно отнести:
<details><summary>некорректное использование специальных слов:</summary>  

К примеру, надо не забывать, что python регистрозависимый язык и случайное неправильное написание какого-то [ключевого слова](https://pythonworld.ru/osnovy/klyuchevye-slova-modul-keyword.html) приведет к ошибке: интерпретатор просто посмотрит, что такого ключевого слова нет и воспримет как переменную, а вы такую переменную не объявляли, так еще и неправильно используете.

```python
>>> some_message = "Hello world!"
>>> i = 10
>>> While i > 0:
  File "<stdin>", line 1
    While i > 0:
          ^
SyntaxError: invalid syntax
```
</details>

<details><summary>забытое ':' после операторов `if` или `while`</summary>

```python
>>> my_list = [1, 6, 5, 4, 7, 8, 9, 10]
>>> 
>>> for number in list
  File "<stdin>", line 1
    for number in list
                     ^
SyntaxError: invalid syntax
```
</details>

<details><summary>неверное количество скобочек в выражениях</summary>

```python
1 def find_roots(a, b, c):
2     D =  b**2 - 4*a*c
3
4     if D < 0:
5         return "There are no real roots"
6     x1 = (-b + D**(0.5) / 2*a
7     x2 = (-b - D**(0.5)) / 2*a
8
9     return x1, x2
10
11 print("ax^2 + bx + c = 0")
12
13 a = int(input("Enter a: "))
14 b = int(input("Enter b: "))
15 c = int(input("Enter c: "))
16 
17 print(find_roots(a, b, c))

File "syntax_errors.py", line 7
    x2 = (-b - D**(0.5)) / 2*a
     ^
SyntaxError: invalid syntax
```

или
```python
>>> print "hello world!"
  File "<stdin>", line 1
    print "Hello world!"
                       ^
SyntaxError: Missing parentheses in call to 'print'
```
</details>

<details><summary>незакрытые кавычки</summary>

```python
1 some_message = "Hello" + "world
2
3 print(some_message)

 File "syntax_errors.py", line 1
    some_message = "Hello" + "world
                                  ^
SyntaxError: EOL while scanning string literal
```

</details>

<details><summary>неправильные отступы</summary>
Да, да, очень важны отступы!

```python
1 x = 1
2   y = 25
3
4 print(x * y)

  File "syntax_errors.py", line 2
    y = 25
    ^
IndentationError: unexpected indent
```
</details>

<details><summary>использование необъявленных переменных</summary>

```python
>>> number_1 = 123
>>> number_2 = 87
>>> 
>>> print(number_1 + numer_2)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
NameError: name 'numer_2' is not defined
>>> 
```
</details>

<details><summary>некорректная передача аргументов</summary>

```python
>>> def add(a ,b):
...     return a + b
... 
>>> 
>>> 
>>> number_1 = 4
>>> number_2 = 3
>>> 
>>> summ = add(number_1, , number_2)
  File "<stdin>", line 1
    summ = add(number_1, , number_2)
                         ^
SyntaxError: invalid syntax
>>> 

```
</details>

Такие ошибки следует исправлять в исходном коде программы.

---
Но бывают такие ситуации, когда синтаксически выражения и операторы могут быть верными, но ошибка может произойти на этапе исполнения программы, но не являться фатальной. Такие ошибки называют **исключениями**. И их можно научиться обрабатывать, чтобы программа не завершалась, а как-то продолжила работать, например, просто сообщив пользователю об ошибке.

Чуть подробней, чем мы разобрали на занятии, хорошо описано [тут](http://pep8.ru/doc/tutorial-2.6/9.html).


 ---
 # Домашнее задание
 
 Написать программу - телефонная книга. 
 Постараться реализовать как можно больше функционала.
 
 1. Все данные при входе в программу считываются из файла
 2. При выходе из программы, все записывается в файл. Давайте договоримся, что формат записи данных в файле будет `id;имя;телефон;имейл;комментарий`
 3. Должна быть функция с выводом меню для пользователя
 4. Данные, которые можно вносить: ФИО, телефон, имейл, комментарий
 
 В меню должна быть возможность:  
 
 5. Добавить новую запись: ФИО должно быть уникальным, телефонов и почт может быть несколько, комментарии все записываются как один текст. При записи, добавляется id записи по порядку  
 6. Удалить запись по имени 
 7. Изменить любые данные в записи  
 8. Поиск по имени/части имени  
 9. Показать всех, кто начинается на %some_str%  
 10. Сохранять в файл  
 
 Дополнительно было бы круто реализовать:  
 11. Проверка, что введенный телефон является телефоном (возможно придумать свой строгий формат и просить вводить)  
 12. Проверка, что введенный имейл является имейлом.  
 13. В аргументы командной строки передавать имя файла откуда брать имена и куда записывать
 
 <details><summary>Можно начать с вот такого кусочка кода (это как пример, можете придумать свой способ организации кода)</summary>
 
 ```python
PERSON_PATTERN = {"name": None, "phone": None, "email": None, "comment": None}
phone_book = []

def print_menu():
	print('''
		Welcome in our pretty phone book!\n\n

		1 - add user
		2 - delete user
		3 - find user by name
		4 - change user
		5 - find user with name starts with "%Jh%"
		6 - save to file
		7 - exit 
		''')

def get_user_action():
	'''
		ну, вы знаете что делать
	'''

def fill_person(person_data):
	person = PERSON_PATTERN.copy()
	person["name"] = person_data[0]
	person["phone"] = person_data[1]
	person["email"] = person_data[2]
	person["comment"] = person_data[3]

	return person


def load_phone_book(path_to_file="phonebook.txt"):
		with open(path_to_file, 'r') as data:
			for line in data:
				person = fill_person(line.split(';')[1:])			 
				phone_book.append(person)


def add_person():
	name = input("Input new name ")
	phone = input("Input new phone ")
	email = input("Input new email ")
	comment = input("Input new comment ")

	person = fill_person([name, phone, email, comment])
	phone_book.append(person)


def find_person_by_name():
	'''
		Итерируемся по списку и сравниваем имена
	'''


def delete_person_by_name(name_of_person):
	'''
		Нужно проитерироваться по списку телефонной книги, найти человека с таким 
		же именем и удалить из списка.
	'''

# это эквивалент функции main из си. С этого участка начнется исполнение вашего кода. 
if __name__ == '__main__':

	load_phone_book()
	print_menu()

	'''
		Попробуйте сами
	'''
 ```
 
 <details><summary>Пример, как может быть записаны данные в файл</summary>
	
	```
	1;Jhon Smith;89049394;jhon.s@mail.com;cool person;
	2;Alla Wollow;958584736262;alla@mail.com;teammate
	```
 </details>
 
 </details>  
 
 
**Если что-то осталось неясным или непонятно, то не стесняйтесь, спрашивайте в ЛС группы.**
